src/stubs/voucher.recharge.stub.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <ars:RechargeRequestMsg>
             <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:BusinessCode>1</cbs:BusinessCode>
            <cbs:MessageSeq>{{trans_id}}</cbs:MessageSeq>
            <cbs:OwnershipInfo>
               <cbs:BEID>101</cbs:BEID>
            </cbs:OwnershipInfo>
            <cbs:AccessSecurity>
         		<cbs:LoginSystemCode>{{username}}</cbs:LoginSystemCode>
               <cbs:Password>{{password}}</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:MsgLanguageCode>2003</cbs:MsgLanguageCode>
         </RequestHeader>
         <RechargeRequest>
            <ars:RechargeSerialNo>{{trans_id}}</ars:RechargeSerialNo>
            <ars:RechargeObj>
               <ars:SubAccessCode>
                  <arc:PrimaryIdentity>{{msisdn}}</arc:PrimaryIdentity>
               </ars:SubAccessCode>
            </ars:RechargeObj>
            <ars:RechargeInfo>
               <ars:CardPayment>
                  <ars:CardPinNumber>{{voucher}}</ars:CardPinNumber>
               </ars:CardPayment>
            </ars:RechargeInfo>
            <ars:AdditionalProperty>
               <arc:Code>C_RECHARGE_PARTY</arc:Code>
               <arc:Value>CRM</arc:Value>
            </ars:AdditionalProperty>
         </RechargeRequest>
      </ars:RechargeRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>
